<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"c85bdc00358a4ab51e22aeb5034c5133b57aaebfddd15de1cdc2ce9f5b9630ff","plan_job_ref":"Job Environment Main - Plan #1465 at https://github.com/jarrod-lowe/wildsea/actions/runs/16668674891","plan_out_hash":"b300e07630251457afcdb424c84ecaf829f6ba65b9966938518f1d35718cada0","plan_hash":"9e24ed307295cccd53e80a0af47843314861cdc16d1ee3d441a775b785bd1bb8","plan_text_format":"diff","version":"2.1.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
domain_name          = "wildsea.lowe.kiwi"
environment          = "primary"
google_client_id     = (sensitive value)
google_client_secret = (sensitive value)
saml_metadata_url    = (sensitive value)
```
</details>
<details>
<summary>Plan: 5 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.deleter_bus will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deleter_bus" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "appsync:GraphQL",
            ]
+           resources = [
+               "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer",
            ]
+           sid       = "InvokeGraphQL"
        }
    }

  # module.wildsea.aws_appsync_function.function["getGameDefaults"] will be created
+   resource "aws_appsync_function" "function" {
+       api_id           = "**************************"
+       arn              = (known after apply)
+       code             = <<-EOT
            // function/getGameDefaults/getGameDefaults.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGameDefaults = "GAMEDEFAULTS";
            var DDBPrefixLanguage = "LANGUAGE";
            
            // lib/constants/defaults.ts
            var FallbackLanguage = "en";
            
            // function/getGameDefaults/getGameDefaults.ts
            function request(context) {
              const gameType = context.prev.result.gameType;
              const language = context.arguments.input.language;
              const keys = [
                util.dynamodb.toMapValues({
                  PK: `${DDBPrefixGameDefaults}#${gameType}`,
                  SK: `${DDBPrefixLanguage}#${language}`
                })
              ];
              if (language !== FallbackLanguage) {
                keys.push(
                  util.dynamodb.toMapValues({
                    PK: `${DDBPrefixGameDefaults}#${gameType}`,
                    SK: `${DDBPrefixLanguage}#${FallbackLanguage}`
                  })
                );
              }
              const tableName = "Wildsea-" + environment_default.name;
              return {
                operation: "BatchGetItem",
                tables: {
                  [tableName]: {
                    keys
                  }
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              const gameType = context.prev.result.gameType;
              const language = context.arguments.input.language;
              const tableName = "Wildsea-" + environment_default.name;
              const results = context.result.data[tableName] || [];
              let gameDefaults = results.find(
                (item) => item && item.SK === `${DDBPrefixLanguage}#${language}`
              );
              if (!gameDefaults && language !== FallbackLanguage) {
                gameDefaults = results.find(
                  (item) => item && item.SK === `${DDBPrefixLanguage}#${FallbackLanguage}`
                );
              }
              let defaults;
              if (gameDefaults) {
                defaults = {
                  defaultCharacterName: gameDefaults.defaultCharacterName,
                  defaultGMName: gameDefaults.defaultGMName
                };
              } else {
                defaults = gameType === "wildsea" ? {
                  defaultCharacterName: "Unnamed Character",
                  defaultGMName: "Firefly"
                } : {
                  defaultCharacterName: "Unidentified Agent",
                  defaultGMName: "Handler"
                };
              }
              context.stash.gameDefaults = defaults;
              return context.prev.result;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiZ2V0R2FtZURlZmF1bHRzLnRzIiwgIi4uLy4uL2Vudmlyb25tZW50Lmpzb24iLCAiLi4vLi4vbGliL2NvbnN0YW50cy9kYlByZWZpeGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGVmYXVsdHMudHMiXSwKICAibWFwcGluZ3MiOiAiO0FBQUEsU0FBUyxZQUFxQjs7O0FDQTlCLDRCQUFDLE1BQU8sVUFBUzs7O0FDUVYsSUFBTSx3QkFBd0I7QUFDOUIsSUFBTSxvQkFBb0I7OztBQ1AxQixJQUFNLG1CQUFtQjs7O0FIUXpCLFNBQVMsUUFBUSxTQUFxRDtBQUMzRSxRQUFNLFdBQVcsUUFBUSxLQUFLLE9BQU87QUFDckMsUUFBTSxXQUFXLFFBQVEsVUFBVSxNQUFNO0FBRXpDLFFBQU0sT0FBTztBQUFBLElBQ1gsS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUN4QixJQUFJLEdBQUcscUJBQXFCLElBQUksUUFBUTtBQUFBLE1BQ3hDLElBQUksR0FBRyxpQkFBaUIsSUFBSSxRQUFRO0FBQUEsSUFDdEMsQ0FBQztBQUFBLEVBQ0g7QUFHQSxNQUFJLGFBQWEsa0JBQWtCO0FBQ2pDLFNBQUs7QUFBQSxNQUNILEtBQUssU0FBUyxZQUFZO0FBQUEsUUFDeEIsSUFBSSxHQUFHLHFCQUFxQixJQUFJLFFBQVE7QUFBQSxRQUN4QyxJQUFJLEdBQUcsaUJBQWlCLElBQUksZ0JBQWdCO0FBQUEsTUFDOUMsQ0FBQztBQUFBLElBQ0g7QUFBQSxFQUNGO0FBRUEsUUFBTSxZQUFZLGFBQWEsb0JBQVk7QUFFM0MsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsUUFBUTtBQUFBLE1BQ04sQ0FBQyxTQUFTLEdBQUc7QUFBQSxRQUNYO0FBQUEsTUFDRjtBQUFBLElBQ0Y7QUFBQSxFQUNGO0FBQ0Y7QUFFTyxTQUFTLFNBQVMsU0FBcUQ7QUFDNUUsTUFBSSxRQUFRLE9BQU87QUFDakIsU0FBSyxNQUFNLFFBQVEsTUFBTSxTQUFTLFFBQVEsTUFBTSxNQUFNLFFBQVEsTUFBTTtBQUFBLEVBQ3RFO0FBRUEsUUFBTSxXQUFXLFFBQVEsS0FBSyxPQUFPO0FBQ3JDLFFBQU0sV0FBVyxRQUFRLFVBQVUsTUFBTTtBQUV6QyxRQUFNLFlBQVksYUFBYSxvQkFBWTtBQUUzQyxRQUFNLFVBQVUsUUFBUSxPQUFPLEtBQUssU0FBUyxLQUFLLENBQUM7QUFHbkQsTUFBSSxlQUFlLFFBQVE7QUFBQSxJQUN6QixDQUFDLFNBQ0MsUUFBUSxLQUFLLE9BQU8sR0FBRyxpQkFBaUIsSUFBSSxRQUFRO0FBQUEsRUFDeEQ7QUFHQSxNQUFJLENBQUMsZ0JBQWdCLGFBQWEsa0JBQWtCO0FBQ2xELG1CQUFlLFFBQVE7QUFBQSxNQUNyQixDQUFDLFNBQ0MsUUFBUSxLQUFLLE9BQU8sR0FBRyxpQkFBaUIsSUFBSSxnQkFBZ0I7QUFBQSxJQUNoRTtBQUFBLEVBQ0Y7QUFFQSxNQUFJO0FBR0osTUFBSSxjQUFjO0FBQ2hCLGVBQVc7QUFBQSxNQUNULHNCQUFzQixhQUFhO0FBQUEsTUFDbkMsZUFBZSxhQUFhO0FBQUEsSUFDOUI7QUFBQSxFQUNGLE9BQU87QUFFTCxlQUNFLGFBQWEsWUFDVDtBQUFBLE1BQ0Usc0JBQXNCO0FBQUEsTUFDdEIsZUFBZTtBQUFBLElBQ2pCLElBQ0E7QUFBQSxNQUNFLHNCQUFzQjtBQUFBLE1BQ3RCLGVBQWU7QUFBQSxJQUNqQjtBQUFBLEVBQ1I7QUFHQSxVQUFRLE1BQU0sZUFBZTtBQUc3QixTQUFPLFFBQVEsS0FBSztBQUN0QjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source      = "Wildsea_primary"
+       function_id      = (known after apply)
+       function_version = (known after apply)
+       id               = (known after apply)
+       name             = "getGameDefaults"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_appsync_function.function["joinGame"] will be updated in-place
!~  resource "aws_appsync_function" "function" {
!~      code                      = <<-EOT
            // function/joinGame/joinGame.ts
            import { util } from "@aws-appsync/utils";
            
            // environment.json
            var environment_default = { name: "primary" };
            
            // lib/constants/entityTypes.ts
            var TypeCharacter = "CHARACTER";
            
            // lib/constants/dbPrefixes.ts
            var DDBPrefixGame = "GAME";
            var DDBPrefixPlayer = "PLAYER";
            
          - // lib/constants/defaults.ts
          - var DefaultPlayerCharacterName = "Unnamed Character";
          - 
            // function/joinGame/joinGame.ts
            function request(context) {
              if (!context.identity) util.unauthorized();
              const identity = context.identity;
              if (!identity?.sub) util.unauthorized();
              const id = context.prev.result.gameId;
              const timestamp = util.time.nowISO8601();
              const gameItem = {
                operation: "UpdateItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + id,
                  SK: DDBPrefixGame
                }),
                update: {
                  expression: "ADD #players :player SET #updatedAt = :updatedAt",
                  expressionNames: {
                    "#players": "players",
                    "#updatedAt": "updatedAt"
                  },
                  expressionValues: {
                    ":player": { SS: [identity.sub] },
                    ":updatedAt": { S: timestamp }
                  }
                }
              };
              const playerData = {
                gameId: id,
                userId: identity.sub,
                GSI1PK: "USER#" + identity.sub,
                gameName: context.prev.result.gameName,
                gameType: context.prev.result.gameType,
                gameDescription: context.prev.result.gameDescription,
          -     characterName: DefaultPlayerCharacterName,
          +     characterName: context.stash.gameDefaults?.defaultCharacterName || "Unnamed Character",
                fireflyUserId: context.prev.result.fireflyUserId,
                type: TypeCharacter,
                createdAt: timestamp,
                updatedAt: timestamp
              };
              const playerItem = {
                operation: "PutItem",
                table: "Wildsea-" + environment_default.name,
                key: util.dynamodb.toMapValues({
                  PK: DDBPrefixGame + "#" + id,
                  SK: DDBPrefixPlayer + "#" + identity.sub
                }),
                attributeValues: util.dynamodb.toMapValues(playerData)
              };
              context.stash.playerData = playerData;
              return {
                operation: "TransactWriteItems",
                transactItems: [gameItem, playerItem]
              };
            }
            function response(context) {
              if (context.error) {
                util.error(context.error.message, context.error.type, context.result);
              }
              return context.stash.playerData;
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiam9pbkdhbWUudHMiLCAiLi4vLi4vZW52aXJvbm1lbnQuanNvbiIsICIuLi8uLi9saWIvY29uc3RhbnRzL2VudGl0eVR5cGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyIsICIuLi8uLi9saWIvY29uc3RhbnRzL2RlZmF1bHRzLnRzIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0F0RCw0QkFBQyxNQUFPLFVBQVM7OztBQ0NWLElBQU0sZ0JBQWdCOzs7QUNEdEIsSUFBTSxnQkFBZ0I7QUFFdEIsSUFBTSxrQkFBa0I7OztBQ0Z4QixJQUFNLDZCQUE2Qjs7O0FKWW5DLFNBQVMsUUFBUSxTQUFxRDtBQUMzRSxNQUFJLENBQUMsUUFBUSxTQUFVLE1BQUssYUFBYTtBQUN6QyxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsVUFBVSxJQUFLLE1BQUssYUFBYTtBQUV0QyxRQUFNLEtBQUssUUFBUSxLQUFLLE9BQU87QUFDL0IsUUFBTSxZQUFZLEtBQUssS0FBSyxXQUFXO0FBRXZDLFFBQU0sV0FBVztBQUFBLElBQ2YsV0FBVztBQUFBLElBQ1gsT0FBTyxhQUFhLG9CQUFZO0FBQUEsSUFDaEMsS0FBSyxLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQzdCLElBQUksZ0JBQWdCLE1BQU07QUFBQSxNQUMxQixJQUFJO0FBQUEsSUFDTixDQUFDO0FBQUEsSUFDRCxRQUFRO0FBQUEsTUFDTixZQUFZO0FBQUEsTUFDWixpQkFBaUI7QUFBQSxRQUNmLFlBQVk7QUFBQSxRQUNaLGNBQWM7QUFBQSxNQUNoQjtBQUFBLE1BQ0Esa0JBQWtCO0FBQUEsUUFDaEIsV0FBVyxFQUFFLElBQUksQ0FBQyxTQUFTLEdBQUcsRUFBRTtBQUFBLFFBQ2hDLGNBQWMsRUFBRSxHQUFHLFVBQVU7QUFBQSxNQUMvQjtBQUFBLElBQ0Y7QUFBQSxFQUNGO0FBRUEsUUFBTSxhQUFhO0FBQUEsSUFDakIsUUFBUTtBQUFBLElBQ1IsUUFBUSxTQUFTO0FBQUEsSUFDakIsUUFBUSxVQUFVLFNBQVM7QUFBQSxJQUMzQixVQUFVLFFBQVEsS0FBSyxPQUFPO0FBQUEsSUFDOUIsVUFBVSxRQUFRLEtBQUssT0FBTztBQUFBLElBQzlCLGlCQUFpQixRQUFRLEtBQUssT0FBTztBQUFBLElBQ3JDLGVBQWU7QUFBQSxJQUNmLGVBQWUsUUFBUSxLQUFLLE9BQU87QUFBQSxJQUNuQyxNQUFNO0FBQUEsSUFDTixXQUFXO0FBQUEsSUFDWCxXQUFXO0FBQUEsRUFDYjtBQUNBLFFBQU0sYUFBYTtBQUFBLElBQ2pCLFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLEtBQUssS0FBSyxTQUFTLFlBQVk7QUFBQSxNQUM3QixJQUFJLGdCQUFnQixNQUFNO0FBQUEsTUFDMUIsSUFBSSxrQkFBa0IsTUFBTSxTQUFTO0FBQUEsSUFDdkMsQ0FBQztBQUFBLElBQ0QsaUJBQWlCLEtBQUssU0FBUyxZQUFZLFVBQVU7QUFBQSxFQUN2RDtBQUVBLFVBQVEsTUFBTSxhQUFhO0FBRTNCLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLGVBQWUsQ0FBQyxVQUFVLFVBQVU7QUFBQSxFQUN0QztBQUNGO0FBRU8sU0FBUyxTQUNkLFNBQ2dDO0FBQ2hDLE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssTUFBTSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFBQSxFQUN0RTtBQUVBLFNBQU8sUUFBUSxNQUFNO0FBQ3ZCOyIsCiAgIm5hbWVzIjogW10KfQo=
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiam9pbkdhbWUudHMiLCAiLi4vLi4vZW52aXJvbm1lbnQuanNvbiIsICIuLi8uLi9saWIvY29uc3RhbnRzL2VudGl0eVR5cGVzLnRzIiwgIi4uLy4uL2xpYi9jb25zdGFudHMvZGJQcmVmaXhlcy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDOzs7QUNBdEQsNEJBQUMsTUFBTyxVQUFTOzs7QUNDVixJQUFNLGdCQUFnQjs7O0FDRHRCLElBQU0sZ0JBQWdCO0FBRXRCLElBQU0sa0JBQWtCOzs7QUhTeEIsU0FBUyxRQUFRLFNBQXFEO0FBQzNFLE1BQUksQ0FBQyxRQUFRLFNBQVUsTUFBSyxhQUFhO0FBQ3pDLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxVQUFVLElBQUssTUFBSyxhQUFhO0FBRXRDLFFBQU0sS0FBSyxRQUFRLEtBQUssT0FBTztBQUMvQixRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsUUFBTSxXQUFXO0FBQUEsSUFDZixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLE1BQzFCLElBQUk7QUFBQSxJQUNOLENBQUM7QUFBQSxJQUNELFFBQVE7QUFBQSxNQUNOLFlBQVk7QUFBQSxNQUNaLGlCQUFpQjtBQUFBLFFBQ2YsWUFBWTtBQUFBLFFBQ1osY0FBYztBQUFBLE1BQ2hCO0FBQUEsTUFDQSxrQkFBa0I7QUFBQSxRQUNoQixXQUFXLEVBQUUsSUFBSSxDQUFDLFNBQVMsR0FBRyxFQUFFO0FBQUEsUUFDaEMsY0FBYyxFQUFFLEdBQUcsVUFBVTtBQUFBLE1BQy9CO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLGFBQWE7QUFBQSxJQUNqQixRQUFRO0FBQUEsSUFDUixRQUFRLFNBQVM7QUFBQSxJQUNqQixRQUFRLFVBQVUsU0FBUztBQUFBLElBQzNCLFVBQVUsUUFBUSxLQUFLLE9BQU87QUFBQSxJQUM5QixVQUFVLFFBQVEsS0FBSyxPQUFPO0FBQUEsSUFDOUIsaUJBQWlCLFFBQVEsS0FBSyxPQUFPO0FBQUEsSUFDckMsZUFDRSxRQUFRLE1BQU0sY0FBYyx3QkFBd0I7QUFBQSxJQUN0RCxlQUFlLFFBQVEsS0FBSyxPQUFPO0FBQUEsSUFDbkMsTUFBTTtBQUFBLElBQ04sV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLEVBQ2I7QUFDQSxRQUFNLGFBQWE7QUFBQSxJQUNqQixXQUFXO0FBQUEsSUFDWCxPQUFPLGFBQWEsb0JBQVk7QUFBQSxJQUNoQyxLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxnQkFBZ0IsTUFBTTtBQUFBLE1BQzFCLElBQUksa0JBQWtCLE1BQU0sU0FBUztBQUFBLElBQ3ZDLENBQUM7QUFBQSxJQUNELGlCQUFpQixLQUFLLFNBQVMsWUFBWSxVQUFVO0FBQUEsRUFDdkQ7QUFFQSxVQUFRLE1BQU0sYUFBYTtBQUUzQixTQUFPO0FBQUEsSUFDTCxXQUFXO0FBQUEsSUFDWCxlQUFlLENBQUMsVUFBVSxVQUFVO0FBQUEsRUFDdEM7QUFDRjtBQUVPLFNBQVMsU0FDZCxTQUNnQztBQUNoQyxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLE1BQU0sUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQUEsRUFDdEU7QUFFQSxTQUFPLFFBQVEsTUFBTTtBQUN2QjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
        id                        = "tfiz6mnf2nhyzpzkwm554sir5q-qymxkjq6xncojk7ftlbs4ikt44"
        name                      = "joinGame"
#        (9 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                            = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                          = "Wildsea-primary"
!~      schema                        = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): GameSummary! @aws_cognito_user_pools(cognito_groups: ["CreateGame"])
                joinGame(input: JoinGameInput!): PlayerSheetSummary! @aws_cognito_user_pools
                updateGame(input: UpdateGameInput!): GameSummary! @aws_cognito_user_pools
                deleteGame(input: DeleteGameInput!): GameSummary! @aws_cognito_user_pools
                updateJoinCode(input: UpdateJoinCodeInput!): GameSummary! @aws_cognito_user_pools
                createSection(input: CreateSectionInput!): SheetSection! @aws_cognito_user_pools
                updateSection(input: UpdateSectionInput!): SheetSection! @aws_cognito_user_pools
                deleteSection(input: DeleteSectionInput!): SheetSection! @aws_cognito_user_pools
                updatePlayer(input: UpdatePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools
                deletePlayer(input: DeletePlayerInput!): PlayerSheetSummary @aws_cognito_user_pools @aws_iam
                createShip(input: CreateShipInput!): PlayerSheetSummary! @aws_cognito_user_pools
                rollDice(input: RollDiceInput!): DiceRoll! @aws_cognito_user_pools
                updateUserSettings(input: UpdateUserSettingsInput!): UserSettings! @aws_cognito_user_pools
            }
            
            type Query {
                getGame(input: GetGameInput): Game! @aws_cognito_user_pools
                getGames: [PlayerSheetSummary!] @aws_cognito_user_pools
                getCharacterTemplates(input: GetCharacterTemplatesInput!): [CharacterTemplateMetadata!]! @aws_cognito_user_pools
                getCharacterTemplate(input: GetCharacterTemplateInput!): [TemplateSectionData!]! @aws_cognito_user_pools
                getUserSettings: UserSettings @aws_cognito_user_pools
            }
            
            type Subscription @aws_cognito_user_pools {
              updatedPlayer(gameId: ID!): PlayerSheetSummary @aws_subscribe(mutations: ["updatePlayer", "deletePlayer", "createShip", "joinGame"])
              updatedSection(gameId: ID!): SheetSection @aws_subscribe(mutations: ["createSection", "updateSection", "deleteSection"])
              updatedGame(gameId: ID!): GameSummary @aws_subscribe(mutations: ["updateGame", "deleteGame"])
              diceRolled(gameId: ID!): DiceRoll @aws_subscribe(mutations: ["rollDice"])
              updatedUserSettings: UserSettings @aws_subscribe(mutations: ["updateUserSettings"])
            }
            
            input GetGameInput {
              gameId: ID!
            }
            
            input GetCharacterTemplatesInput {
              gameType: String!
              language: String!
            }
            
            input GetCharacterTemplateInput {
              templateName: String!
              gameType: String!
              language: String!
            }
            
            input CreateGameInput {
                name: String!
                gameType: String!
                description: String
            }
            
            input JoinGameInput {
              joinCode: String!
          +   language: String!
            }
            
            input DeleteGameInput {
              gameId: ID!
            }
            
            input UpdateGameInput {
              gameId: ID!
              name: String!
              description: String
            }
            
            input UpdateJoinCodeInput {
              gameId: ID!
            }
            
            input DeletePlayerInput {
              gameId: ID!
              userId: ID!
            }
            
            input CreateSectionInput {
              userId: ID
              gameId: ID!
              sectionName: String!
              sectionType: String!
              content: AWSJSON
              position: Int!
            }
            
            input UpdateSectionInput {
              gameId: ID!
              sectionId: ID!
              sectionName: String
              content: AWSJSON
              position: Int
            }
            
            input DeleteSectionInput {
              gameId: ID!
              sectionId: ID!
            }
            
            type GameSummary @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              joinCode: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            type Game @aws_cognito_user_pools {
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String
              playerSheets: [PlayerSheet!]!
              joinCode: String
              fireflyUserId: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              type: String!
              deleted: Boolean
            }
            
            input UpdatePlayerInput {
              gameId: ID!
              userId: ID!
              characterName: String!
            }
            
            input CreateShipInput {
              gameId: ID!
              characterName: String!
            }
            
            type PlayerSheetSummary @aws_cognito_user_pools @aws_iam {
              userId: ID!
              gameId: ID!
              gameName: String!
              gameType: String!
              gameDescription: String!
              characterName: String!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            type PlayerSheet @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              characterName: String!
              sections: [SheetSection!]!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              fireflyUserId: ID!
            }
            
            type SheetSection @aws_cognito_user_pools {
              userId: ID!
              gameId: ID!
              sectionId: ID!
              type: String!
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
              deleted: Boolean
            }
            
            union Dice = SingleDie
            
            input DiceInput {
              type: String!
              size: Int!
            }
            
            input RollDiceInput {
              gameId: ID!
              dice: [DiceInput!]!
              action: String
              rollType: String!
              target: Int!
              onBehalfOf: ID
            }
            
            type DiceRoll @aws_cognito_user_pools {
              gameId: ID!
              playerId: ID!
              playerName: String!
              dice: [Dice!]!
              rollType: String!
              target: Int!
              grade: String!
              action: String
              diceList: [Dice!]!
              value: Int!
              rolledAt: AWSDateTime!
              rolledBy: String!
              proxyRoll: Boolean!
              type: String!
              messageIndex: Int!
            }
            
            type SingleDie @aws_cognito_user_pools {
              type: String!
              size: Int!
              value: Int!
            }
            
            type CharacterTemplateMetadata @aws_cognito_user_pools {
              templateName: String!
              displayName: String!
              gameType: String!
              language: String!
            }
            
            type TemplateSectionData @aws_cognito_user_pools {
              sectionName: String!
              sectionType: String!
              content: AWSJSON!
              position: Int!
            }
            
            type UserSettings @aws_cognito_user_pools {
              userId: ID!
              settings: AWSJSON!
              type: String!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
            }
            
            input UpdateUserSettingsInput {
              settings: AWSJSON!
            }
        EOT
        tags                          = {
            "Name" = "Wildsea-primary"
        }
#        (11 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.pipeline["joinGame"] will be updated in-place
!~  resource "aws_appsync_resolver" "pipeline" {
        id                = "tfiz6mnf2nhyzpzkwm554sir5q-Mutation-joinGame"
#        (10 unchanged attributes hidden)

!~      pipeline_config {
!~          functions = [
-               "shrklx5txjeznimsqx5vxrhmh4",
-               "qymxkjq6xncojk7ftlbs4ikt44",
            ] -> (known after apply)
        }
    }

  # module.wildsea.aws_dynamodb_table_item.gamedefaults_deltagreen_en will be created
+   resource "aws_dynamodb_table_item" "gamedefaults_deltagreen_en" {
+       hash_key   = "**"
+       id         = (known after apply)
+       item       = jsonencode(
            {
+               PK                   = {
+                   S = "GAMEDEFAULTS#deltaGreen"
                }
+               SK                   = {
+                   S = "LANGUAGE#en"
                }
+               defaultCharacterName = {
+                   S = "Unidentified Agent"
                }
+               defaultGMName        = {
+                   S = "Handler"
                }
+               type                 = {
+                   S = "GAMEDEFAULTS"
                }
            }
        )
+       range_key  = "**"
+       table_name = "Wildsea-primary"
    }

  # module.wildsea.aws_dynamodb_table_item.gamedefaults_deltagreen_tlh will be created
+   resource "aws_dynamodb_table_item" "gamedefaults_deltagreen_tlh" {
+       hash_key   = "**"
+       id         = (known after apply)
+       item       = jsonencode(
            {
+               PK                   = {
+                   S = "GAMEDEFAULTS#deltaGreen"
                }
+               SK                   = {
+                   S = "LANGUAGE#tlh"
                }
+               defaultCharacterName = {
+                   S = "Sovbe'ghach DIch"
                }
+               defaultGMName        = {
+                   S = "DIch SeHwI'"
                }
+               type                 = {
+                   S = "GAMEDEFAULTS"
                }
            }
        )
+       range_key  = "**"
+       table_name = "Wildsea-primary"
    }

  # module.wildsea.aws_dynamodb_table_item.gamedefaults_wildsea_en will be created
+   resource "aws_dynamodb_table_item" "gamedefaults_wildsea_en" {
+       hash_key   = "**"
+       id         = (known after apply)
+       item       = jsonencode(
            {
+               PK                   = {
+                   S = "GAMEDEFAULTS#wildsea"
                }
+               SK                   = {
+                   S = "LANGUAGE#en"
                }
+               defaultCharacterName = {
+                   S = "Unnamed Character"
                }
+               defaultGMName        = {
+                   S = "Firefly"
                }
+               type                 = {
+                   S = "GAMEDEFAULTS"
                }
            }
        )
+       range_key  = "**"
+       table_name = "Wildsea-primary"
    }

  # module.wildsea.aws_dynamodb_table_item.gamedefaults_wildsea_tlh will be created
+   resource "aws_dynamodb_table_item" "gamedefaults_wildsea_tlh" {
+       hash_key   = "**"
+       id         = (known after apply)
+       item       = jsonencode(
            {
+               PK                   = {
+                   S = "GAMEDEFAULTS#wildsea"
                }
+               SK                   = {
+                   S = "LANGUAGE#tlh"
                }
+               defaultCharacterName = {
+                   S = "motlhbe' jup"
                }
+               defaultGMName        = {
+                   S = "yoDwI'"
                }
+               type                 = {
+                   S = "GAMEDEFAULTS"
                }
            }
        )
+       range_key  = "**"
+       table_name = "Wildsea-primary"
    }

  # module.wildsea.aws_iam_policy.deleter_bus will be updated in-place
!~  resource "aws_iam_policy" "deleter_bus" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-deleter-bus"
        name             = "Wildsea-primary-deleter-bus"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "appsync:GraphQL"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:appsync:ap-southeast-2:021891603679:apis/tfiz6mnf2nhyzpzkwm554sir5q/types/Mutation/fields/deletePlayer"
-                       Sid      = "InvokeGraphQL"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
#        (7 unchanged attributes hidden)
    }

Plan: 5 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #1465](https://github.com/jarrod-lowe/wildsea/actions/runs/16668674891)